[{"name":"\n\t8KG DOUBLE HANDLE GRIP MEDICINE BALL","price":"€","description":"\nPrice including VAT\nPhoenix Fitness Double Handle Grip Medicine Ball | 8kg Unisex Med Ball with Anti-Slip Textured Surface | Ergonomic Dual Handle for Strengthening Core Muscles, Cardio Workouts and Resistance Training\n\nTEXTURED GRIP – The Phoenix Fitness Medicine Ball has a textured surface with double grip handles to increase control and ability to handle heavier weights whilst increasing your range of exercises.\nNO BOUNCE – Our medicine ball has a reduced bounce element to help tone your muscles and improves your core. The dual handles can help with a thrust motion to improve your explosive power.\nCORE MUSCLES – Ideal for strengthening your core muscle and ab workouts. Designed for extra comfort leading to a more focused workout experience. Easy to incorporate resistance training.\nFEEL THE BURN – Become ripped with the Phoenix Fitness Medicine Ball during your fitness exercise routines and training. You will feel muscles working which you never knew you had before!\nCHALLENGE YOURSELF – You can challenge both your muscular and cardio system whilst strengthening core muscles. Use this medicine ball for planks, crunches and many more exercises.\n\nWeight (kg): 8\nItem Dims: 240 x 240 x 200mm\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/ry859-6_576x576.jpg"},{"name":"\n\tBATTLE ROPE – 5M","price":"€","description":"","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/01/battle-ropes.jpg"},{"name":"\n\tBODY BALANCE BOARD","price":"€","description":"\n\nPrice including VAT\nPhoenix Fitness Body Balance Board – Non-Slip Round Wobble Board – 36cm Training Balance Board Perfect for Core Strength, Balance, Rehabilitation, Stability, Physio Therapy and Coordination\n\nPOST INJURY REHABILITATION – The Phoenix Fitness Body Balance Board is brilliant to help with your recovery from injury and speed up your rehabilitation.\nIMPROVES CORE STRENGTH – Centrally weighted board to help improve your core strength and help tone your leg muscles and buttocks.\nNON-SLIP BOARD – Non slip foot grip. Designed to improve your traction with the non-skin board for a variety of different exercises.\nHELPS BALANCE – Helps improves your balance and coordination and support recovery from sprains, twists and ankle / knee surgery.\nTILTS – The Phoenix Fitness boards tilts front to back and side to side. It also spins completely around. One size fits all, suitable for children and adults.\n\nWeight (kg): 0.583\nItem Dims: 365 x 365 x 60mm\n\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY1012-14_576x576.jpg"},{"name":"\n\tDOOR SIT UP BAR","price":"€","description":"\n\n\n\n\n\n\n\nPrice including VAT\nPhoenix Fitness Door Sit-Up Bar – Doorway Portable Sports Crunch Bar for Abdominal Exercises – Sit Up Bar with Adjustable Height Levels and Padded Ankle Bar – Home Workout Exercise Bar Device\n\nSLIDES UNDER DOOR – The Phoenix Fitness Sit-up bar slides easily under the door and tightens on with a clamp to fit any size doors for your home workouts.\n3 ADJUSTABLE HEIGHTS – The ankle rests can be adjusted to suit the height you require for the perfect sit-up and crunch positions and technique.\nPADDED FOOT AND ANKLE RESTS – The Phoenix Fitness Sit Up Bar has Neoprene-Padded footrests for extra comfort and support on your ankles.\nFOAM PADS FOR DOOR – No details forgotten, The Phoenix Fitness Door Sit-Up bar has a padded clamp on the sit up bar so they will not damage your doors.\nQUICK RELEASE – Excellent design with a quick release oversized screw on the clamp. Easy to fit on any door and easy to remove and store away.\n\n\n\n\n\n\n\n\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY848-7_576x576.jpg"},{"name":"\n\tDUMBBELL","price":"€€","description":"\nPrice including VAT\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/01/1kg-duuumbell.jpg"},{"name":"\n\tFOAM YOGA BLOCK","price":"€","description":"\nPrice including VAT\nMyga Foam Yoga Block – High Density EVA Foam Yoga Brick – Lightweight Odour Resistant Moisture Proof Pilates Yoga Block\n\nCOMPLETE THE COLLECTION – Complete the Myga collection with the Water Bottle, Yoga Block, Yoga Mat and the Yoga Belt which all colour match perfectly.\nMUST HAVE PROP – The Myga Foam Yoga Block is a fantastic way to improve your balance and deepen your flexibility.\nHELPS WITH INJURY – The Foam Yoga Brick helps bring awareness to your body so that you can feel the engagement and muscle support.\nNEW POSES – Our Foam Yoga Brick can help you reach more difficult post and helps you get into your positions safely.\nYOGA FOR EVERYONE – Ideal yoga equipment for both beginners and advanced yogis.\n\nWeight (kg): 0.125\nItem Dims: 230 x 150 x 75mm\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY1060-2_576x576.jpg"},{"name":"\n\tHAND GRIP STRENGTHENERS","price":"€","description":"\nPrice including VAT\nPhoenix Fitness Set of 2 Hand Grip Strengtheners – Hand Exercises with Foam Gripper Handles – Wrist Exercising Resistance Training – Forearm Muscle Strength Building – Grip Workout for Stress Relief – Pink\n\nHAND STRENGTH – The Phoenix Fitness twin set of Hand Grip Strengtheners are brilliant to increase the strength in both of your hands and fingers.\nWRIST AND FOREARM – Quickly and effectively strengthen the muscles in your arms and wrists by squeezing the grips together and releasing slowly.\nPERFECT FOR REHAB – Excellent for injury prevention and recovery. Broken a bone in your finger or hand, use this gripper to build the strength back up.\nGRIP STRENGTH – Ideal for sports athletes and musicians as this hand exercise tool will improve your grip and hand endurance.\nCOMFORT – Ergonomically designed with foam handles, the power spring gripped with soft and comfortable on your hands.\n\nWeight (kg): 0.275\nItem Dims: 140 x 100 x 55mm\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/ry915_02_576x576.jpg"},{"name":"\n\tKETTLE BELL 10KG – PINK","price":"€","description":"\nPrice including VAT\nPhoenix Fitness 10KG Pink Kettlebell – Heavy Weight Kettle Bell for Strength Cardio Training – Kettlebells for Home and Gym Fitness Workout for Bodybuilding Weight Lifting\n\nERGONOMIC GRIP – The Phoenix Fitness Kettlebells are ergonomically designed to support your hand grip and offer extra comfort during your exercise workout routine.\nCHALLENGE YOUR BODY – You can challenge both your muscular and cardio system with these kettle bells, increasing your strength, endurance, agility and balance.\nCOLOURED AND LABELLED – A soft pastel pink colour, with a darker viynl coated sticker in the middle so you can easily differentiate your weights.\nWORKOUT GUIDE – The Phoenix Fitness Kettle Bell branded boxes also have workout suggestions on the back showcasing which exercise works different muscle groups\n\nWeight (kg): 10\nItem Dims: 250 x 235 x 195mm\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY1424-5_576x576.jpg"},{"name":"\n\tKETTLE BELL 12KG – PINK","price":"€","description":"\n\n\n\nPrice including VAT\nPhoenix Fitness 12KG Kettlebell – Heavy Weight Kettle Bell for Strength Cardio Training – Kettlebells for Home and Gym Fitness Workout for Bodybuilding Weight Lifting\n\nERGONOMIC GRIP – The Phoenix Fitness Kettlebells are ergonomically designed to support your hand grip and offer extra comfort during your exercise workout routine.\nCHALLENGE YOUR BODY – You can challenge both your muscular and cardio system with these kettle bells, increasing your strength, endurance, agility and balance.\nCOLOURED AND LABELLED – Brightly coloured to differentiate between the different weights, with a clear bold label on the kettlebell too. Ideal for commercial gyms and your home.\nVINYL COATED – Our kettle bell is designed to last with a strong vinyl coat which is easy clean. Ideal for use indoors or outdoors for your workout needs.\nWORKOUT GUIDE – The Phoenix Fitness Kettle Bell branded boxes also have workout suggestions on the back showcasing which exercise works different muscle groups.\n\nWeight (kg): 12\nItem Dims: 275x230x210mm\n\n\n\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/12kg-pink.jpg"},{"name":"\n\tKETTLE BELL 20KG – PINK","price":"€","description":"","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/01/20kg-kett5lebell.jpg"},{"name":"\n\tKETTLE BELL 2KG – PINK","price":"€","description":"\n\n\n\n\n\n\nPrice including VAT\n\n\n\n\n\n\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/s-l1600.jpg"},{"name":"\n\tKETTLE BELL 4KG","price":"€","description":"","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/01/4kg-kettle-bell.jpg"},{"name":"\n\tKETTLE BELL 6KG","price":"€","description":"","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/01/6kg-kettle-bell-2.jpg"},{"name":"\n\tKETTLE BELL 6KG – PINK","price":"€","description":"\n\n\n\n\n\nPrice including VAT\nPhoenix Fitness 6KG Pink Kettlebell – Heavy Weight Kettle Bell for Strength Cardio Training – Kettlebells for Home and Gym Fitness Workout for Bodybuilding Weight Lifting\n\nERGONOMIC GRIP – The Phoenix Fitness Kettlebells are ergonomically designed to support your hand grip and offer extra comfort during your exercise workout routine.\nCHALLENGE YOUR BODY – You can challenge both your muscular and cardio system with these kettle bells, increasing your strength, endurance, agility and balance.\nCOLOURED AND LABELLED – A soft pastel pink colour, with a darker viynl coated sticker in the middle so you can easily differentiate your weights.\nWORKOUT GUIDE – The Phoenix Fitness Kettle Bell branded boxes also have workout suggestions on the back showcasing which exercise works different muscle groups\n\n\n\n\n\n\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY1422-5_576x576.jpg"},{"name":"\n\tKETTLE BELL 8KG","price":"€","description":"","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/01/8kg-kettle-bell-1.jpg"},{"name":"\n\tKids Dinosaur Yoga Mat","price":"€","description":"","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/11/dinosaur-kids-yoga.jpg"},{"name":"\n\tKids Sweet Tooth Yoga Mat","price":"€","description":"","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/11/sweet-tooth-yoga.jpg"},{"name":"\n\tMEDICINE BALL 3KG","price":"€","description":"","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY929-3_bfe6b104-b614-48ee-934e-40021ea0e54a_576x576.jpg"},{"name":"\n\tPHOENIX FITNESS 0.5KG WRIST ANKLE WEIGHTS","price":"€","description":"\n\nPrice including VAT\nA pair of ankle, wrist weights are ideal for adding intensity to walking, jogging and toning exercises.\nKeep your hands free and your workouts hardcore with the Phoenix Fitness Ankle Wrist Weights, designed to help you further tone your body.\nTwo pack 0.5kg (each) adjustable wrist / ankle straps\nAdjustable straps for secure fastening\nThese ankle wrist weights as part of your exercise regime will require you to use more energy for each move, increasing your calorie burn and improving your heart health.\n2lbs weight (approx) One size fits most\nGreat for use at home or in the gym\nHelps develop, strengthen and tone your body\n\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/06/s-l1600-4.jpg"},{"name":"\n\tPHOENIX FITNESS CIRCLE RESISTANCE BANDS","price":"€","description":"","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/06/RY978-7grey_900x.jpg"},{"name":"\n\tPHOENIX FITNESS DEEP TISSUE MASSAGE ROLLER","price":"€","description":"\n\n\nPrice including VAT\n\n\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/06/PhoenixFitnessEVAFoamRollerforDeepTissueMassage_1024x1024.jpg"},{"name":"\n\tPHOENIX FITNESS EXERCISE DICE","price":"€","description":"\nPrice including VAT\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/06/RY1051-12_900x.jpg"},{"name":"\n\tPHOENIX FITNESS RESISTANCE TUBE","price":"€","description":"\n\nPrice including VAT\nPhoenix Fitness Resistance Tube Band Set with Handle to Use with Legs or Bar – Resistance Tube for Exercise Fitness Workout Routines – Gym or Home Toning Strength Training – Light, Medium and Strong\n\nCOMPLETE WORKOUT – The Phoenix Fitness Resistance tube bands help to strengthen multiple parts of the body with different exercises including legs, arms, back, abs, shoulders and buttocks.\nPADDED EVA HANDLES – Designed with durability and comfort in mind, our Resistance Bands come with EVA padded handles to a more comfortable firm grip during your exercises.\nIMPROVES CORE – As well as strength training, the Phoenix Fitness Resistance Tubes will improve your core muscle strength and definition. With a light, medium and strong tube available.\nTONES MUSCLES – Tones and strengthens muscles with a full body workout. Ideal for crossfit, yoga, pilates and any strength and power training in the home or gym.\nRECOVERY FROM INJURIES – Excellent rehab equipment for people trying to recover from any injuries or reoccurring pain by improving muscular strength. 120cm in length approx.\n\n\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY918_02_576x576.jpg"},{"name":"\n\tPHOENIX FITNESS YOGA EXERCISE MAT","price":"€","description":"","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/10/YOGA.jpg"},{"name":"\n\tSPEED SKIPPING JUMP ROPE","price":"€","description":"\n\nPrice including VAT\nPhoenix Fitness Speed Skipping Rope – Lightweight Jump Rope – Jumping Tangle Free Rope – Speed Rope for Fat Burning, Fat Loss, Conditioning, Interval Training, Boxing, Crossfit and MMA\n\nLIGHTWEIGHT – The Phoenix Fitness Speed Skipping Rope has lightweight handles which are designed for speed and balance.\nFITNESS TRAINING – Brilliant jump rope for fitness training. Jumping is great for cardiovascular workouts and conditioning.\nFOOT SPEED – This Phoenix Fitness exercise skipping rope will quickly improve your fitness, stamina, agility and foot speed.\nFAT LOSS – Ideal for fat loss and fat burning. Full body cardio workout with exceptional results for your general fitness.\nMULTI SPORT – Excellent skipping rope for boxing, MMA, thai boxing, crossfit, fitness training and interval training as it uses all of the body.\n\nWeight (kg): 0.83\nItem Dims: 230 x 53 x 53 mm\n\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY917_11_576x576.jpg"},{"name":"\n\tTHIGH TONER","price":"€","description":"\n\n\n\n\nPrice including VAT\nPhoenix Fitness Thigh Toner Muscle Toning Gym or Home Equipment – Blaster Toner for Trimming Arms, Abs, Butt and Legs – Shape Your Body with the Inner Leg Toner – Pink\n\nFIRM, TONE AND STRENGTHEN – Designed to tone and sculpt your body without adding bulk so this Thigh Toner is excellent for fat burning and general fitness.\nPROLONGED COMFORT – Thick foam padding provides extra comfort for prolonged exercise routines and workouts. Excellent addition to your training programme.\nMEDIUM RESISTANCE – The Phoenix Fitness Thigh Toners heavy duty spring provides medium resistance so it is suitable for any user – Beginners to experts.\nIMPROVES CORE – As well as toning your arms and legs, it is also great for your core muscles. Tightens arms, tones chest, shapes outer thighs, firms inner thighs and sculpts buttocks.\nHOME OR GYM – Small and compact in design so easy to store away in your home or in the fitness gym or studio.\n\n\n\n\n\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY1555PinkThighToner-10_576x576.jpg"},{"name":"\n\tWEIGHT LIFTING GLOVES","price":"€","description":"","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/01/weight-gloves-2.jpg"},{"name":"\n\tWEIGHTED FOAM FITNESS HULA HOOP – PINK","price":"€","description":"\n\n\n\nPrice including VAT\nPhoenix Fitness RY1546 1.1kg Weighted Foam Padded Fitness Hula Hoop Ring – Wave Groove Design for Core Balance and Strengthening, Pink – 96cm\n\nWAVE GROOVE DESIGN – The Phoenix Fitness Fitness Hoop has a wave groove design to help increase your circulation and flexibility. With a weight of 1.1kg, the fitness ring will help maintain your momentum.\nFOAM PADDED – Durable plastic core which is covered with soft EVA Foam with moulded inner ridges. Comfortable for the user, easy to clean and resists bacteria and moisture from penetrating the surface.\nEASY ASSEMBLY – The Phoenix Fitness Weighted Fitness Ring is easy to assemble. Comes in 8 sections which click together. Adjustable for children so you can use 7 sections to make it smaller.\nCORE MUSCLE STRENGTH – Basic hula hooping can burn up to 200+ calories within a 30 minute workout routine. A weighted hula hoop strengthens inner core muscles of the body to improve posture and reduce risk of back problems.\nTRIMS YOUR WAISTLINE – Helps develop mobility of the spine and hips, helping to ensure the joints remain flexible. Extremely effective at losing weight around the stomach / abdomen area.\n\n \n\n\n\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY1546_02_576x576.jpg"},{"name":"\n\tWEIGHTED SKIPPING JUMP ROPE","price":"€","description":"\n\n\nPrice including VAT\n\n\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY916_02_576x576.jpg"},{"name":"\n\tYOGA MAT","price":"€","description":"","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/01/yoga-mat-blue.jpg"},{"name":"\n\tYOGA MAT 173 X 61CM","price":"€","description":"\n\n\nPrice including VAT\nMyga Entry Level Yoga Mat – Exercise Mat for Pilates – Travel Non-Slip Multi Purpose Fitness Mat – Core Workout for Home, Gym, Yoga Studio\n\nUPLIFTING – The Myga Entry Level Yoga Mat is perfect for a yoga beginner starting on their journey, or as a spare for any yoga enthusiast.\nMULTI PURPOSE – Use our brilliant fitness mat for yoga, vinyasa, power yoga, hatha, ashtanga, yin, iyengar, and restorative yoga.\nON THE MOVE – It’s lightweight, easy to roll up, quick drying and comfortable to carry, making it great for travelling.\nEASY CLEAN – Wipe your mat with a damp cloth after every session and let it hang to dry out of the sun.\nRECOVERY – The Myga yoga mat can also help people recover from injuries and provide an excellent fitness tool.\n\nWeight (kg): 1\n\n\n","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/07/lightpink_c72ca492-b4e2-4297-825a-cd38b4265388_576x576.jpg"},{"name":"\n\tYOGA SOCKS","price":"€","description":"","image":"https://www.mrpriceonline.ie/wp-content/uploads/2021/01/yoga-socks-pink-1.jpg"}]