[
  {
    "name": "8KG DOUBLE HANDLE GRIP MEDICINE BALL",
    "pageUrl": "https://www.mrpriceonline.ie/product/8kg-double-handle-grip-medicine-ball/",
    "price": "€39.99",
    "description": "Price including VATPhoenix Fitness Double Handle Grip Medicine Ball | 8kg Unisex Med Ball with Anti-Slip Textured Surface | Ergonomic Dual Handle for Strengthening Core Muscles, Cardio Workouts and Resistance TrainingTEXTURED GRIP – The Phoenix Fitness Medicine Ball has a textured surface with double grip handles to increase control and ability to handle heavier weights whilst increasing your range of exercises.NO BOUNCE – Our medicine ball has a reduced bounce element to help tone your muscles and improves your core. The dual handles can help with a thrust motion to improve your explosive power.CORE MUSCLES – Ideal for strengthening your core muscle and ab workouts. Designed for extra comfort leading to a more focused workout experience. Easy to incorporate resistance training.FEEL THE BURN – Become ripped with the Phoenix Fitness Medicine Ball during your fitness exercise routines and training. You will feel muscles working which you never knew you had before!CHALLENGE YOURSELF – You can challenge both your muscular and cardio system whilst strengthening core muscles. Use this medicine ball for planks, crunches and many more exercises.Weight (kg): 8Item Dims: 240 x 240 x 200mm",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/07/ry859-6_576x576.jpg"
  },
  {
    "name": "BATTLE ROPE – 5M",
    "pageUrl": "https://www.mrpriceonline.ie/product/battle-rope-5m/",
    "price": "€29.99",
    "description": "",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/01/battle-ropes.jpg"
  },
  {
    "name": "DUMBBELL",
    "pageUrl": "https://www.mrpriceonline.ie/product/dumbbells/",
    "price": "€6.99",
    "description": "Price including VAT",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/01/1kg-duuumbell.jpg"
  },
  {
    "name": "FOAM YOGA BLOCK",
    "pageUrl": "https://www.mrpriceonline.ie/product/foam-yoga-block/",
    "price": "€3.99",
    "description": "Price including VATMyga Foam Yoga Block – High Density EVA Foam Yoga Brick – Lightweight Odour Resistant Moisture Proof Pilates Yoga BlockCOMPLETE THE COLLECTION – Complete the Myga collection with the Water Bottle, Yoga Block, Yoga Mat and the Yoga Belt which all colour match perfectly.MUST HAVE PROP – The Myga Foam Yoga Block is a fantastic way to improve your balance and deepen your flexibility.HELPS WITH INJURY – The Foam Yoga Brick helps bring awareness to your body so that you can feel the engagement and muscle support.NEW POSES – Our Foam Yoga Brick can help you reach more difficult post and helps you get into your positions safely.YOGA FOR EVERYONE – Ideal yoga equipment for both beginners and advanced yogis.Weight (kg): 0.125Item Dims: 230 x 150 x 75mm",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY1060-2_576x576.jpg"
  },
  {
    "name": "HAND GRIP STRENGTHENERS",
    "pageUrl": "https://www.mrpriceonline.ie/product/hand-grip-strengtheners/",
    "price": "€2.99",
    "description": "Price including VATPhoenix Fitness Set of 2 Hand Grip Strengtheners – Hand Exercises with Foam Gripper Handles – Wrist Exercising Resistance Training – Forearm Muscle Strength Building – Grip Workout for Stress Relief – PinkHAND STRENGTH – The Phoenix Fitness twin set of Hand Grip Strengtheners are brilliant to increase the strength in both of your hands and fingers.WRIST AND FOREARM – Quickly and effectively strengthen the muscles in your arms and wrists by squeezing the grips together and releasing slowly.PERFECT FOR REHAB – Excellent for injury prevention and recovery. Broken a bone in your finger or hand, use this gripper to build the strength back up.GRIP STRENGTH – Ideal for sports athletes and musicians as this hand exercise tool will improve your grip and hand endurance.COMFORT – Ergonomically designed with foam handles, the power spring gripped with soft and comfortable on your hands.Weight (kg): 0.275Item Dims: 140 x 100 x 55mm",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/07/ry915_02_576x576.jpg"
  },
  {
    "name": "KETTLE BELL 10KG – PINK",
    "pageUrl": "https://www.mrpriceonline.ie/product/kettle-bell-10kg-pink/",
    "price": "€19.99",
    "description": "Price including VATPhoenix Fitness 10KG Pink Kettlebell – Heavy Weight Kettle Bell for Strength Cardio Training – Kettlebells for Home and Gym Fitness Workout for Bodybuilding Weight LiftingERGONOMIC GRIP – The Phoenix Fitness Kettlebells are ergonomically designed to support your hand grip and offer extra comfort during your exercise workout routine.CHALLENGE YOUR BODY – You can challenge both your muscular and cardio system with these kettle bells, increasing your strength, endurance, agility and balance.COLOURED AND LABELLED – A soft pastel pink colour, with a darker viynl coated sticker in the middle so you can easily differentiate your weights.WORKOUT GUIDE – The Phoenix Fitness Kettle Bell branded boxes also have workout suggestions on the back showcasing which exercise works different muscle groupsWeight (kg): 10Item Dims: 250 x 235 x 195mm",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY1424-5_576x576.jpg"
  },
  {
    "name": "KETTLE BELL 12KG – PINK",
    "pageUrl": "https://www.mrpriceonline.ie/product/kettle-bell-12kg-pink/",
    "price": "€24.99",
    "description": "Price including VATPhoenix Fitness 12KG Kettlebell – Heavy Weight Kettle Bell for Strength Cardio Training – Kettlebells for Home and Gym Fitness Workout for Bodybuilding Weight LiftingERGONOMIC GRIP – The Phoenix Fitness Kettlebells are ergonomically designed to support your hand grip and offer extra comfort during your exercise workout routine.CHALLENGE YOUR BODY – You can challenge both your muscular and cardio system with these kettle bells, increasing your strength, endurance, agility and balance.COLOURED AND LABELLED – Brightly coloured to differentiate between the different weights, with a clear bold label on the kettlebell too. Ideal for commercial gyms and your home.VINYL COATED – Our kettle bell is designed to last with a strong vinyl coat which is easy clean. Ideal for use indoors or outdoors for your workout needs.WORKOUT GUIDE – The Phoenix Fitness Kettle Bell branded boxes also have workout suggestions on the back showcasing which exercise works different muscle groups.Weight (kg): 12Item Dims: 275x230x210mm",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/07/12kg-pink.jpg"
  },
  {
    "name": "KETTLE BELL 2KG – PINK",
    "pageUrl": "https://www.mrpriceonline.ie/product/kettlebell-2kg-pink/",
    "price": "€5.99",
    "description": "Price including VAT",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/07/s-l1600.jpg"
  },
  {
    "name": "KETTLE BELL 4KG",
    "pageUrl": "https://www.mrpriceonline.ie/product/kettle-bell-4kg/",
    "price": "€9.99",
    "description": "",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/01/4kg-kettle-bell.jpg"
  },
  {
    "name": "KETTLE BELL 6KG",
    "pageUrl": "https://www.mrpriceonline.ie/product/kettle-bell-6kg/",
    "price": "€14.99",
    "description": "",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/01/6kg-kettle-bell-2.jpg"
  },
  {
    "name": "KETTLE BELL 6KG – PINK",
    "pageUrl": "https://www.mrpriceonline.ie/product/kettlebell-6kg-pink/",
    "price": "€14.99",
    "description": "Price including VATPhoenix Fitness 6KG Pink Kettlebell – Heavy Weight Kettle Bell for Strength Cardio Training – Kettlebells for Home and Gym Fitness Workout for Bodybuilding Weight LiftingERGONOMIC GRIP – The Phoenix Fitness Kettlebells are ergonomically designed to support your hand grip and offer extra comfort during your exercise workout routine.CHALLENGE YOUR BODY – You can challenge both your muscular and cardio system with these kettle bells, increasing your strength, endurance, agility and balance.COLOURED AND LABELLED – A soft pastel pink colour, with a darker viynl coated sticker in the middle so you can easily differentiate your weights.WORKOUT GUIDE – The Phoenix Fitness Kettle Bell branded boxes also have workout suggestions on the back showcasing which exercise works different muscle groups",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY1422-5_576x576.jpg"
  },
  {
    "name": "KETTLE BELL 8KG",
    "pageUrl": "https://www.mrpriceonline.ie/product/kettle-bell-8kg/",
    "price": "€17.99",
    "description": "",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/01/8kg-kettle-bell-1.jpg"
  },
  {
    "name": "Kids Dinosaur Yoga Mat",
    "pageUrl": "https://www.mrpriceonline.ie/product/kids-dinosaur-yoga-mat/",
    "price": "€19.99",
    "description": "",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/11/dinosaur-kids-yoga.jpg"
  },
  {
    "name": "Kids Sweet Tooth Yoga Mat",
    "pageUrl": "https://www.mrpriceonline.ie/product/kids-sweet-tooth-yoga-mat/",
    "price": "€19.99",
    "description": "",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/11/sweet-tooth-yoga.jpg"
  },
  {
    "name": "PHOENIX FITNESS 0.5KG WRIST ANKLE WEIGHTS",
    "pageUrl": "https://www.mrpriceonline.ie/product/phoenix-fitness-0-5kg-wrist-ankle-weights/",
    "price": "€4.99",
    "description": "Price including VATA pair of ankle, wrist weights are ideal for adding intensity to walking, jogging and toning exercises.Keep your hands free and your workouts hardcore with the Phoenix Fitness Ankle Wrist Weights, designed to help you further tone your body.Two pack 0.5kg (each) adjustable wrist / ankle strapsAdjustable straps for secure fasteningThese ankle wrist weights as part of your exercise regime will require you to use more energy for each move, increasing your calorie burn and improving your heart health.2lbs weight (approx) One size fits mostGreat for use at home or in the gymHelps develop, strengthen and tone your body",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/06/s-l1600-4.jpg"
  },
  {
    "name": "PHOENIX FITNESS DEEP TISSUE MASSAGE ROLLER",
    "pageUrl": "https://www.mrpriceonline.ie/product/phoenix-fitness-deep-tissue-massage-roller/",
    "price": "€8.99",
    "description": "Price including VAT",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/06/PhoenixFitnessEVAFoamRollerforDeepTissueMassage_1024x1024.jpg"
  },
  {
    "name": "PHOENIX FITNESS EXERCISE DICE",
    "pageUrl": "https://www.mrpriceonline.ie/product/phoenix-fitness-exercise-dice/",
    "price": "€4.99",
    "description": "Price including VAT",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/06/RY1051-12_900x.jpg"
  },
  {
    "name": "PHOENIX FITNESS RESISTANCE TUBE",
    "pageUrl": "https://www.mrpriceonline.ie/product/phoenix-fitness-resistance-tube/",
    "price": "€2.99",
    "description": "Price including VATPhoenix Fitness Resistance Tube Band Set with Handle to Use with Legs or Bar – Resistance Tube for Exercise Fitness Workout Routines – Gym or Home Toning Strength Training – Light, Medium and StrongCOMPLETE WORKOUT – The Phoenix Fitness Resistance tube bands help to strengthen multiple parts of the body with different exercises including legs, arms, back, abs, shoulders and buttocks.PADDED EVA HANDLES – Designed with durability and comfort in mind, our Resistance Bands come with EVA padded handles to a more comfortable firm grip during your exercises.IMPROVES CORE – As well as strength training, the Phoenix Fitness Resistance Tubes will improve your core muscle strength and definition. With a light, medium and strong tube available.TONES MUSCLES – Tones and strengthens muscles with a full body workout. Ideal for crossfit, yoga, pilates and any strength and power training in the home or gym.RECOVERY FROM INJURIES – Excellent rehab equipment for people trying to recover from any injuries or reoccurring pain by improving muscular strength. 120cm in length approx.",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY918_02_576x576.jpg"
  },
  {
    "name": "PHOENIX FITNESS YOGA EXERCISE MAT",
    "pageUrl": "https://www.mrpriceonline.ie/product/phoenix-fitness-yoga-exercise-mat/",
    "price": "€8.99",
    "description": "",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/10/YOGA.jpg"
  },
  {
    "name": "PUSH UP BARS",
    "pageUrl": "https://www.mrpriceonline.ie/product/push-up-bars/",
    "price": "€6.99",
    "description": "Price including VATPhoenix Fitness Push Up Bar Stand – Press Up Bar Pair with Non-Slip Foam Handles for Extra Grip – Push-Up Press-Up Stand for Chest, Arms and Shoulder Training Exercise WorkoutMUSCLE DEVELOPMENT – The Phoenix Fitness Push Up Bars are ideal for developing muscles in the chest, arms and shoulders. Can also build the abdominal core muscles.FOAM HANDLES – The Press Up Stand is ergonomically designed with padded EVA Foam handles for extra grip and support, whilst offering support to your hands.RUBBER CAPS – Rubber end caps for the S shaped push-up bars to protect floor surfaces and helps to add stability during your workout routines.STURDY DESIGN – One piece tubular metal construction can support. The Phoenix Fitness Press Up bars allows for a greater range of motion and skid resistant.EASY TO USE – No assembly required and brilliant for beginners and fitness enthusiasts. They are perfect for sculpting and defining upper body muscles, primarily used for muscle groups such as Pectorals and Triceps.Weight (kg): 0.75Item Dims: 210 x 130 x 128mm",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY934-2_576x576.jpg"
  },
  {
    "name": "THIGH TONER",
    "pageUrl": "https://www.mrpriceonline.ie/product/thigh-toner/",
    "price": "€5.99",
    "description": "Price including VATPhoenix Fitness Thigh Toner Muscle Toning Gym or Home Equipment – Blaster Toner for Trimming Arms, Abs, Butt and Legs – Shape Your Body with the Inner Leg Toner – PinkFIRM, TONE AND STRENGTHEN – Designed to tone and sculpt your body without adding bulk so this Thigh Toner is excellent for fat burning and general fitness.PROLONGED COMFORT – Thick foam padding provides extra comfort for prolonged exercise routines and workouts. Excellent addition to your training programme.MEDIUM RESISTANCE – The Phoenix Fitness Thigh Toners heavy duty spring provides medium resistance so it is suitable for any user – Beginners to experts.IMPROVES CORE – As well as toning your arms and legs, it is also great for your core muscles. Tightens arms, tones chest, shapes outer thighs, firms inner thighs and sculpts buttocks.HOME OR GYM – Small and compact in design so easy to store away in your home or in the fitness gym or studio.",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/07/RY1555PinkThighToner-10_576x576.jpg"
  },
  {
    "name": "YOGA MAT",
    "pageUrl": "https://www.mrpriceonline.ie/product/yoga-mat/",
    "price": "€9.99",
    "description": "",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/01/yoga-mat-blue.jpg"
  },
  {
    "name": "YOGA MAT 173 X 61CM",
    "pageUrl": "https://www.mrpriceonline.ie/product/yoga-mat-173-x-61cm/",
    "price": "€9.99",
    "description": "Price including VATMyga Entry Level Yoga Mat – Exercise Mat for Pilates – Travel Non-Slip Multi Purpose Fitness Mat – Core Workout for Home, Gym, Yoga StudioUPLIFTING – The Myga Entry Level Yoga Mat is perfect for a yoga beginner starting on their journey, or as a spare for any yoga enthusiast.MULTI PURPOSE – Use our brilliant fitness mat for yoga, vinyasa, power yoga, hatha, ashtanga, yin, iyengar, and restorative yoga.ON THE MOVE – It’s lightweight, easy to roll up, quick drying and comfortable to carry, making it great for travelling.EASY CLEAN – Wipe your mat with a damp cloth after every session and let it hang to dry out of the sun.RECOVERY – The Myga yoga mat can also help people recover from injuries and provide an excellent fitness tool.Weight (kg): 1",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/07/lightpink_c72ca492-b4e2-4297-825a-cd38b4265388_576x576.jpg"
  },
  {
    "name": "YOGA SOCKS",
    "pageUrl": "https://www.mrpriceonline.ie/product/yoga-socks/",
    "price": "€1.99",
    "description": "",
    "image": "https://www.mrpriceonline.ie/wp-content/uploads/2021/01/yoga-socks-pink-1.jpg"
  }
]
